/*

                 *´¨) 
                ¸.•´ ¸.•´¸.•*´¨) ¸.•*¨) 
                (¸.•´ (¸.•` ¤ 𝕭𝖗𝖆𝖓𝖉𝖔𝖓 𝕮𝖆𝖑𝖉𝖊𝖗𝖔𝖓 𝕻𝖗𝖎𝖊𝖙𝖔  
       .---.         
      /     \   𝖈𝖆𝖑𝖉𝖊𝖗𝖔𝖓.𝖇𝖗𝖆𝖓𝖉𝖔𝖓@𝖈𝖔𝖗𝖗𝖊𝖔𝖚𝖓𝖎𝖛𝖆𝖑𝖑𝖊.𝖊𝖉𝖚.𝖈𝖔      
      \.@-@./               
      /`\_/`\               202125974
     //  _  \\        
    | \     )|_        𝕴𝖓𝖌𝖊𝖓𝖎𝖊𝖗𝖎𝖆 𝖉𝖊 𝖘𝖎𝖘𝖙𝖊𝖒𝖆𝖘
   /`\_`>  <_/ \
   \__/'---'\__/

*/

const x1 = 3;
const y1 = 5;
const x2 = 4;
const y2 = 2;
const x3 = 7;
const y3 = 8;

const puntos = { p1:{ x: x1, y: y1 }, p2:{ x: x2, y: y2 }, p3:{ x: x3, y: y3 } };

console.log(puntos);


/* 
Alternativa mas ordenada

const p1 = { x: x1, y: y1 };
const p2 = { x: x2, y: y2 };
const p3 = { x: x3, y: y3 };

const puntos = {p1, p2, p3};
*/